<template>
<MainHeader />

<div class="header-margin container info">
    <h1>Политика конфиденциальности</h1>
    <span>
        <p>Обработка персональных данных пользователя осуществляется в соответствии с законодательством Российской Федерации. Администрация Сайта 
          обрабатывает персональные данные Пользователя в целях предоставления Пользователю услуг.</p>
        <p><span >Пользователь, заполняя форму &laquo;Имя&raquo;, &laquo;Емейл&raquo;, &laquo;Телефон&raquo;, даёт 
          согласие на обработку своих персональных данных: имени, адреса электронной почты и телефона. Под обработкой персональных данных 
          понимается сбор, систематизация, накопление, уточнение (обновление, изменение).</span></p>
        <p><span >Обработка осуществляется с использованием средств автоматизации и/или без использования таких 
          средств, в целях реализации мероприятий оповещения пользователя о изменениях на сайте и по поддержке обратной связи с 
          пользователями сайта.</span></p>
        <p><span >В соответствии с ФЗ от 27.07.2006 г. № 152-ФЗ &laquo;О персональных данных&raquo; я 
          согласен, при необходимости, во время заполнения информации при регистрации в сайте, входе в Личный кабинет или при 
          отправке заявки на участие в сеансе онлайн-связи предоставить информацию, относящуюся к моей личности, например: мое 
          имя, мой адрес электронной почты, мой контактный телефон.</span></p>
        <p><span >Компания </span>{{ orgName }}<span >
           (далее - Компания) соблюдает права пользователей (далее &ndash; Пользователи) на неразглашение личной информации и в 
           полной мере принимает на себя обязательства по сохранению личных данных, переданных в адрес компании. Компания уверена, 
           что Пользователи (включая зарегистрированных) ее продукции и услуг имеют полное право знать о политике и способах 
           обработки информации, получаемой ею во время посещения, получения доступа и использования ее веб-сайта по адресу 
          </span>{{ siteUrl }}<span > (далее &mdash; Сайт), а также в ходе использования 
            Услуг (определение которых можно найти в Лицензионном соглашении (далее - ЛС) с Компанией).</span></p>
        <h2>Согласие</h2>
        <p><span >Пожалуйста, внимательно ознакомьтесь со следующей информацией: используя сайт 
          или услуги, получая доступ к сайту, предоставляя информацию посредством указанного сайта, регистрируя учетную 
          запись (определение учетной записи приведено в ЛС) на сайте, вы соглашаетесь на правила, описанные в тексте 
          политики конфиденциальности, включая те, которые имеют отношение к сбору и обработке ваших личных данных 
          (как указано ниже) (далее &mdash; политика конфиденциальности).</span></p>
        <p>&nbsp;</p>
        <h3>Сбор информации</h3>
        <p><span >Компания может собирать анонимную неличную информацию (далее &ndash; 
          Неличная информация), предоставленную Пользователями. К Неличной информации относится любая нескрываемая
           информация, которая становится доступной Компании во время получения доступа на Сайт и его 
           непосредственного использования. Неличная информация может содержать, помимо прочего, данные об 
           идентификации браузера Пользователя, так же как и оперативной системы, порядок посещения страниц 
           Пользователем, время и дату подключения Пользователя и т.п. Данная информация собирается для ведения 
           статистики и применяется для улучшения качества Услуг, предоставляемых компанией, а также усовершенствования 
           интерфейса Сайта. Компания может собирать Личную информацию, добровольно и сознательно предоставляемую 
           Пользователями во время создания Учетной записи через Сайт или регистрации иным способом для получения 
           Услуг. &laquo;Личная информация&raquo; означает индивидуальные данные, такие как фамилия и имя, номер 
           мобильного телефона и адрес электронной почты. Кроме того, чтобы наиболее эффективно предоставлять 
           Услуги, компания собирает информацию о вашем местонахождении при помощи GPS-навигатора, которая 
           (информация) может быть идентифицирована и передана Поставщикам услуг (как определено в ЛС).</span></p>
        <p><span >Во избежание недоразумений любая Неличная информация, имеющая отношение 
          к Личной информации или связанная с ней, будет рассматриваться как Личная до тех пор, пока существует такая связь/отношение.</span></p>
        <h3>Использование информации</h3>
        <p><span >Компания может использовать Личную информацию, чтобы:</span></p>
        <ul>
            <li ><span >предоставлять Услуги;</span></li>
            <li ><span >отправлять сообщения Пользователям относительно Услуг 
              (например, дату прибытия Поставщика услуг в местоположение Пользователя и т.п.);</span></li>
            <li ><span >предоставлять пользователям поддержку;</span></li>
            <li ><span >отправлять рекламные материалы для целевой аудитории 
              и сообщать о льготных предложениях (далее &ndash; Рекламные материалы);</span></li>
            <li ><span >также, на сайте происходит сбор и обработка обезличенных 
              данных о посетителях (в т.ч. файлов &laquo;cookie&raquo;) с помощью сервиса интернет-статистики &laquo;Яндекс Метрика&raquo;.</span></li>
        </ul>
        <h3>Разглашение информации</h3>
        <p><span >Компания обязуется не разглашать какую-либо Личную информацию, полученную ею от третьих 
          лиц. Несмотря на это, она может раскрывать подобную информацию в следующих случаях:</span></p>
        <ul>
            <li ><span >для соблюдения требований применимого закона, постановления, 
              судебного процесса, судебной повестки или требований правительства;</span></li>
            <li ><span >для обеспечения соблюдения данной Политики конфиденциальности 
              или ЛС, включая исследование потенциальных нарушений указанных регламентов;</span></li>
            <li ><span >для обнаружения, предотвращения или решения вопросов, с
              вязанных с обманом, безопасностью или техническими аспектами;</span></li>
            <li ><span >для ответов на просьбы Пользователей о поддержке;</span></li>
            <li ><span >для реагирования на претензии относительно того, что то или 
              иное информационное наполнение нарушает права третьих лиц;</span></li>
            <li ><span >для реагирования на претензии относительно того, что контактная
               информация (например, имя, адрес и т.п.) третьей стороны были опубликованы или переданы без ее согласия или в качестве оскорбления;</span></li>
            <li ><span >для защиты прав, собственности или личной безопасности 
              Компании, ее Пользователей или широкой публики;</span></li>
            <li ><span >если в компании меняется система управления, включая случаи 
              слияния, поглощения или покупки всего имущества компании либо значительной его части; (к) чтобы вы могли наиболее 
              эффективно использовать Услуги, информация о вашем местонахождении, полученная через GPS-навигатор, будет передана 
              Поставщикам услуг (как определено в УИ);</span></li>
            <li ><span >согласно вашему ясно выраженному предварительному разрешению. 
              Во избежание недоразумений компания может передавать и разглашать Неличную информацию третьим лицам по собственному усмотрению.</span></li>
        </ul>
        <h3>Изменение личной информации</h3>
        <p><span >Пользователи могут получать доступ к своей Учетной записи и вносить изменения в графу с 
          Личной информацией. Информацию о том, как отправить запрос на изменение любой Личной информации, предоставленной вами 
          Компании можно получить по электронному адресу </span>
          {{ siteEmail }}<span >.</span></p>
        <h3>Cookies файлы</h3>
        <p><span >В то время, как вы посещаете сайт, Компания может использовать общеотраслевую технологию, 
          называемую &laquo;куки&raquo; (cookies), которая позволяет сохранить определенную информацию на вашем компьютере. Cookies 
          представляют собой небольшие текстовые файлы, которые могут использоваться только веб-сайтом, который их создал. Cookies 
          позволяют выполнить автоматический вход на сайт: зарегистрированные пользователи будут идентифицированы автоматически. 
          В большинстве Интернет-браузеров есть функция очистки компьютера от cookies-файлов, блокировки их приема или отправки 
          уведомления каждый раз перед сохранением подобного файла. Однако после блокировки или удаления cookies ваши возможности 
          в интерактивной деятельности могут быть ограничены. Более подробная информация об этой функции содержится в инструкциях 
          к браузеру или на страницах &laquo;Справки&raquo;</span></p>
        <h3>Безопасность</h3>
        <p><span >Компания уделяет много внимания обеспечению и поддержанию безопасности Личной информации 
          Пользователей. Она применяет стандартные отраслевые технологии и методы, чтобы гарантировать безопасность пользовательских 
          данных, а также предотвратить их несанкционированное использование. Среди других способов пользовательская Личная 
          информация защищена при помощи брандмауэра, шифрованного протокола (SSL) и зашифрованных данных. Несмотря на это, 
          компания не может гарантировать абсолютной защиты данных. Пользователи должны держать в секрете номер своей Учетной 
          записи и иную информацию о ней, рекомендуется время от времени менять пароль входа.</span></p>
        <h3>Изменения</h3>
        <p><span >Положения Политики конфиденциальности являются неотъемлемой частью этого Сайта и 
          любой информации, размещенной на нем, и не могут рассматриваться отдельно от Лицензионного соглашения. Компания 
          оставляет за собой право менять Политику конфиденциальности в любое время, поэтому рекомендует посещать эту страницу 
          как можно чаще. В случае значительных изменений компания может заменить ссылку &laquo;Политика конфиденциальности&raquo;
          на главной странице сайте на ссылку, озаглавленную &laquo;Новая версия Политики конфиденциальности от 01/01/2017&raquo;.
            Изменения к данной Политике конфиденциальности вступают в силу с даты, указанной для &laquo;Последней версии&raquo;; 
            продолжая пользоваться Сайтом после даты выхода &laquo;Последней версии&raquo;, вы соглашаетесь на внесенные изменения
            и соблюдение правил, основанных на таких изменениях.</span></p>
        <h3>Сайты третьих лиц</h3>
        <p><span >На Сайте могут находиться ссылки на другие веб-сайты, которые не являются частью
          Сайта Компании (далее &ndash; Сайты третьих лиц). Они являются независимыми, а компания не несет ответственности 
          за политику обращения с личной информацией и другие правовые аспекты использования таких сайтов. Рекомендуем 
          Пользователям ознакомиться с политикой конфиденциальности на Сайтах третьих лиц.</span></p>
    </span>
</div>

<Footer />
</template>

<script setup>
import { useHead } from '@unhead/vue'
useHead({
    title: "Политика конфиденциальности",
    meta: [
        {
            name: 'description',
            content: 'Политика конфиденциальности'
        }
    ]
})
import {
    ref,
    onMounted,
    computed
} from 'vue';
import { useSiteInfo } from '@/stores/siteInfo';
const siteInfoStore = useSiteInfo();
import MainHeader from "../components/MainHeader.vue";
import Footer from "@/components/Footer.vue";
import axios from 'axios';

let data = ref({});
const siteUrl = computed(()=> {
  if(window.location.origin.includes('https')) return window.location.origin.replace('https://', '');
  if(window.location.origin.includes('http')) return window.location.origin.replace('http://', '');
});
const siteEmail = computed(() => siteInfoStore.siteInfo.email);
const orgName = computed(() => siteInfoStore.siteInfo.organization_name);
const init = async () => {
    let response = await axios.get('/showcase-params');
    data.value = response.data.settings.policy;
};
onMounted(() => {
    init();
});
</script>
